public/go/hook/index.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <title>
  Go语言实现hook管理 · Okuer
</title>
    <meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="color-scheme" content="light dark">




<meta name="author" content="ghost">
<meta name="description" content=" 实现Hook管理 下面介绍一个实现一个简单的Hook管理的思路">
<meta name="keywords" content="blog,developer,personal">

<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="Go语言实现hook管理"/>
<meta name="twitter:description" content=" 实现Hook管理 下面介绍一个实现一个简单的Hook管理的思路"/>

<meta property="og:title" content="Go语言实现hook管理" />
<meta property="og:description" content=" 实现Hook管理 下面介绍一个实现一个简单的Hook管理的思路" />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://blog.okuer.com/go/hook/" /><meta property="article:section" content="go" />
<meta property="article:published_time" content="2023-08-23T00:00:00+00:00" />
<meta property="article:modified_time" content="2023-08-23T00:00:00+00:00" />




<link rel="canonical" href="https://blog.okuer.com/go/hook/">


<link rel="preload" href="/fonts/forkawesome-webfont.woff2?v=1.2.0" as="font" type="font/woff2" crossorigin>


  
  
  <link rel="stylesheet" href="/css/coder.min.0fa2dc75ed1b76894ac0e062b10a6c4730daa745096fa120114b290ed8a48788.css" integrity="sha256-D6Lcde0bdolKwOBisQpsRzDap0UJb6EgEUspDtikh4g=" crossorigin="anonymous" media="screen" />






  
    
    
    <link rel="stylesheet" href="/css/coder-dark.min.593028e7f7ac55c003b79c230d1cd411bb4ca53b31556c3abb7f027170e646e9.css" integrity="sha256-WTAo5/esVcADt5wjDRzUEbtMpTsxVWw6u38CcXDmRuk=" crossorigin="anonymous" media="screen" />
  



 




<link rel="icon" type="image/png" href="/images/favicon-32x32.png" sizes="32x32">
<link rel="icon" type="image/png" href="/images/favicon-16x16.png" sizes="16x16">

<link rel="apple-touch-icon" href="/images/apple-touch-icon.png">
<link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon.png">

<link rel="manifest" href="/site.webmanifest">
<link rel="mask-icon" href="/images/safari-pinned-tab.svg" color="#5bbad5">




<meta name="generator" content="Hugo 0.110.0">





  </head>






<body class="preload-transitions colorscheme-auto">
  
<div class="float-container">
    <a id="dark-mode-toggle" class="colorscheme-toggle">
        <i class="fa fa-adjust fa-fw" aria-hidden="true"></i>
    </a>
</div>


  <main class="wrapper">
    <nav class="navigation">
  <section class="container">
    <a class="navigation-title" href="/">
      Okuer
    </a>
    
      <input type="checkbox" id="menu-toggle" />
      <label class="menu-button float-right" for="menu-toggle">
        <i class="fa fa-bars fa-fw" aria-hidden="true"></i>
      </label>
      <ul class="navigation-list">
        
          
            <li class="navigation-item">
              <a class="navigation-link" href="/posts">Blog</a>
            </li>
          
            <li class="navigation-item">
              <a class="navigation-link" href="/go">Go</a>
            </li>
          
            <li class="navigation-item">
              <a class="navigation-link" href="/project">Projects</a>
            </li>
          
            <li class="navigation-item">
              <a class="navigation-link" href="/about/">About</a>
            </li>
          
        
        
      </ul>
    
  </section>
</nav>


    <div class="content">
      
  <section class="container page">
  <article>
    <header>
      <h1 class="title">
        <a class="title-link" href="https://blog.okuer.com/go/hook/">
          Go语言实现hook管理
        </a>
      </h1>
    </header>

    
<style>
    @keyframes blink {
        0% { opacity: 1; }
        50% { opacity: 0; }
        100% { opacity: 1; }
    }
    .custom-cursor {
        cursor: pointer;
        animation: blink 2s 1;
    }
</style>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
实现Hook管理
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p class="custom-cursor" style="color:gray">下面介绍一个实现一个简单的Hook管理的思路</p
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
背景
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>在go语言的生态下，通过实现hook来让流程扩展性更好。
   比如在一个 <code>Action</code> 的前后通过hook 来进行增强.这些hook 可以从外部来加载。
   甚至在多租户的系统下，不通的租户有自己的hook。</p>
<ol>
<li>hook 可以自己注册到系统</li>
<li>hook 拥有名称</li>
<li>hook 可以 <code>mount-able</code></li>
<li>hook 的执行可观测</li>
</ol>
</div>
</div>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
原理
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<ul>
<li>go build tags
 利用 <strong><strong>build tag</strong></strong> 可以让不同租户加载打包不通的Source code</li>
</ul>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>  go build -tags tenantA main.go</span></span></code></pre></div>
</div>
<ul>
<li>go init
<strong><strong>go init</strong></strong> 方法会在 package main 被依赖的时候 自动执行 并且可以导入整个package
因此借助于init 方法，可以将自身注册到系统中</li>
</ul>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
实现细节
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<pre class="example">

type OrderHook struct{
  Name string
  Order int64
  Hook HookFunc
}
</pre>
</div>
</div>
</div>
</div>

  </article>
</section>

  

    </div>

    <footer class="footer">
  <section class="container">
    ©
    
      2014 -
    
    2023
     ghost 
    ·
    
    Powered by <a href="https://gohugo.io/">Hugo</a> & <a href="https://github.com/luizdepra/hugo-coder/">Coder</a>.
    
  </section>
</footer>

  </main>

  

  
  
  <script src="/js/coder.min.6ae284be93d2d19dad1f02b0039508d9aab3180a12a06dcc71b0b0ef7825a317.js" integrity="sha256-auKEvpPS0Z2tHwKwA5UI2aqzGAoSoG3McbCw73gloxc="></script>
  

  

  


  

  

  

  

  

  

  

  

  

  

  
</body>

</html>
